IDEA StatiCa Open Model
BoltParam.ShearInThread Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Indicates, whether a shear plane is in the thread of a bolt.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool ShearInThread { get; set; }
Public Property ShearInThread As Boolean
	Get
	Set
public:
property bool ShearInThread {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace